Revit 2024 API
BuiltInFailures.MEPCalculationFailures.HydraulicSeparationOfOneSystem Property
 Unable to hydraulically separate the loop when both supply and return are assigned to the same system. Try again with both start and end selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId HydraulicSeparationOfOneSystem { get; }
Visual Basic
Public Shared ReadOnly Property HydraulicSeparationOfOneSystem As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ HydraulicSeparationOfOneSystem {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace